import React from 'react';
import s from './Post.module.css';

/***************************************************************************************************************************
 * !Модульный css позволяет генерировать уникальные хэш-ключи для классов, чтобы они не пересеклись и нам над этим не думать,
 * !но ЛУЧШЕ делать придерживаясь методологии БЭМ. Это уже к версткивопросы, поэтому пока так пусть будет
 ****************************************************************************************************************************/

const Post = (props) => {
  return (
    <div className={s.item}>
      <img src='https://ichef.bbci.co.uk/news/640/cpsprodpb/1352A/production/_103464197_luke-watkin.gif' />
      <div>
        {props.message}
      </div>
      <div>
        <span>like</span> {props.likesCount}
      </div>
    </div>
  )
}

export default Post;